{
     "0.1.0" : {
          "description" : "<ul><li>Initial release.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4"
     },
     "0.1.1" : {
          "description" : "<ul><li>Updated readme file.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4"
     },
     "0.1.2" : {
          "description" : "<ul><li>Feature - Added support for customizing the Avarda Checkout through a filter.</li><li>Fix - Fix for endless spinning wheel at checkout if something went wrong in Avarda.</li><li>Change the way plugin is fetching data from payment status request.</li><li>Initialize new payment at checkout if current payment timed out.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4"
     },
     "0.1.3" : {
          "description" : "<ul><li>Fix - Fix for extra checkout fields not showing up on checkout page.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1"
     },
     "0.1.4" : {
          "description" : "<ul><li>Enhancement - Prevent doing update request when payment has state Completed or TimedOut.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1" 
     },
     "0.1.5" : {
          "description" : "<ul><li>Enhancement - Support for Swedish, Finnish and English language in the checkout.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1" 
     },
     "0.1.6" : {
          "description" : "<ul><li>Tweak - Initialize payment request is using the Avarda legacy endpoint.</li><li>Enhancement - Trigger event when Avarda Checkout form is loaded on checkout page.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "0.1.7" : {
          "description" : "<ul><li>Fix - Load correct JavaScript checkout file depending on if plugin is in testmode or not.</li><li>Fix - Delete request token transient when credentials is changed.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "0.1.8" : {
          "description" : "<ul><li>Enhancement - Avarda payment method title is added to the WooCommerce order.</li><li>Enhancement - Added support for displaying the languages Norwegian and Danish in Avarda checkout.</li><li>Enhancement - WooCommerce order number is now saved as the order reference in AvardaOnline.</li><li>Fix - Fix for validating order correct in checkout.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "0.1.9" : {
          "description" : "<ul><li>Enhancement - Added Swedish translation.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "0.2.0" : {
          "description" : "<ul><li>Enhancement - Added support for server side callback url. Handles order status control better for payments where customer not returning to shop after completed Card/Swish payments.</li><li>Tweak - Increased timeout time to 10 seconds in request to Avarda.</li><li>Tweak - Move Woo order confirmation process to separate class.</li><li>Fix - Don't make cancel or activate requests if the WooCommerce order hasn't been paid for.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.5.1"
     },
     "1.0.0" : {
          "description" : "<ul><li>Tweak - Tweak WC checkout form submission logic. The plugin is no longer reliant on a hashchange to send beforeSubmitContinue reponse to Avarda.</li><li>Tweak - Adds logging to logfile from frontend actions in checkout (during payment completion).</li><li>Tweak - Don't load checkout scripts on thankyou page.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.6"
     },
     "1.0.1" : {
          "description" : "<ul><li>Tweak - Added stack trace to logger.</li><li>Tweak - Reduce the amount of update requests in checkout.</li><li>Fix - Delete current purchase id stored in Woo session if GET or PUT request to Avarda fails.</li></ul>",
          "requires" : "5.0.0",
          "tested" : "5.7.1"
     },
     "1.1.0" : {
          "description" : "<ul><li>Feature - Adds support for sending in termsAndConditionsUrl to Avarda (if set in WooCommerce).</li><li>Tweak - Changed Initialize checkout request endpoint to /api/partner/payments/.</li><li>Tweak - Adds request_url to logging.</li></ul>",
          "requires" : "5.0.0",
          "tested" : "5.7.2"
     }
}